In [1]:
# Import dependencies
import pandas as pd
import sqlite3

In [4]:
test_df = pd.read_csv("../EURUSD_HistoricalPrices.csv")
test_df = test_df.sort_index(ascending=False)
test_df.head()

         Date    Open    High     Low   Close
262  01/01/24  1.1058  1.1080  1.1037  1.1047
261  01/02/24  1.1046  1.1056  1.0938  1.0940
260  01/03/24  1.0937  1.0967  1.0895  1.0922
259  01/04/24  1.0920  1.0975  1.0915  1.0946
258  01/05/24  1.0945  1.0998  1.0877  1.0939

In [10]:
cad_usd_df = pd.read_csv("../../CAD_USD_Prices.csv")
cad_usd_df = cad_usd_df.sort_index(ascending=False)
cad_usd_df.head()

         Date    Open    High     Low   Close
262  01/01/24  1.3265  1.3393  1.3207  1.3238
261  01/02/24  1.3239  1.3337  1.3229  1.3322
260  01/03/24  1.3321  1.3375  1.3317  1.3354
259  01/04/24  1.3355  1.3368  1.3317  1.3350
258  01/05/24  1.3353  1.3400  1.3288  1.3366

In [11]:
jpy_usd_df = pd.read_csv("../../JPY_USD_Prices.csv")
jpy_usd_df = jpy_usd_df.sort_index(ascending=False)
jpy_usd_df.head()

         Date    Open    High     Low   Close
262  01/01/24  141.03  141.41  140.82  140.88
261  01/02/24  140.88  142.22  140.82  141.99
260  01/03/24  141.99  143.73  141.86  143.28
259  01/04/24  143.29  144.85  142.87  144.63
258  01/05/24  144.63  145.96  143.81  144.62

In [12]:
conn = sqlite3.connect('test.sqlite')

In [13]:
test_df.to_sql('eur_usd', conn, if_exists='replace', index=False)
cad_usd_df.to_sql('cad_usd', conn, if_exists='replace', index=False)
jpy_usd_df.to_sql('jpy_usd', conn, if_exists='replace', index=False)

263

In [9]:
conn.close()